Repository: PyraOS/dbp
Catalog: po/*.po
Languages: sv

source: Returns a token that you use to unmount the package
sv: Returnerar ett monterings-ID som används för att avmontera paketet

source: getmount - Returns the mountpoint for the media the package is on. Takes pkgid
sv: getmount - Returnerar monteringspunkten för mediat paketet ligger på. Inparameter: paket-ID

source: id - Returns the pkgid for the package at <path>
sv: id - Returnerar paket-ID för paketet vid <sökväg>

source: list - Lists all registered packages
sv: list - Lista alla paket registrerade i databasen

source: mount - Mounts a package so that it can be executed. Takes pkgid.
sv: mount - Monterar ett paket så att det kan köras. Inparameter: paket-ID.

source: path - Returns the path for the package with id <pkgid>
sv: path - Returnerar sökvägen till paketet <paket-ID>

source: ping - Pings dbpd, exits with a failure if dbpd isn't running
sv: ping - Skickar ett testpaket till dbpd, avslutar med en felkod om dbpd inte kör

source: register - Register a package in the database. Takes path to package file
sv: register - Registrerar ett paket i databasen. Inparameter: sökväg till paketfilen

source: umount - Unmounts the package if no other instance is using it. Takes mount token
sv: umount - Avmonterar paketet om ingen annan instans använder det. Inparameter: monterings-ID

source: unregister - Unregisters a package in the database. Takes path to package file
sv: unregister - Avregistrerar ett paket ur databasen. Inparameter: Sökväg till paketfilen

source: A registered package have its executables and .desktop files exported
sv: Ett registrerat paket har sina körbara filer och .desktop-startare installerade

source: An unhandled error has occured. This is just a placehoder that you shouldn't see.
sv: Ett oväntat fel har inträffat.

source: An unknown internal error has occured. This is only supposed to be a placeholder. You should examine the DBP System daemon log-file for further information.
sv: Ett oväntat fel har inträffat. Det här är ett temporärt medelande som används under utveckling. Undersök loggfilerna för DBP-demonen för vidare information.

source: By Steven Arnow, 2015, version %s
sv: Av Steven Arnow, 2015, version %s

source: Error:
sv: Fel:

source: Error: %s
sv: Fel: %s

source: Error: Unknown option '%s'
sv: Fel: okänd kommandoradsparameter '%s'

source: Error: You need to specify the meta key to extract
sv: Fel: Du behöver specificera meta-nyckeln att hämta värde från

source: Error: unknown option '%s'
sv: Fel: okänd kommandoparameter '%s'

source: Executes a dbpd system call, version %s
sv: Skickar ett systemanrop till dbpd, version %s

source: Extracts configuration keys out of the DBP config
sv: Extraherar konfigurationsnycklar från DBP-systemets konfigurationsfil

source: Extracts meta keys from a DBP
sv: Extraherar meta-nycklar från en DBP-fil

source: Install missing dependencies
sv: Installera saknade beroenden

source: Key '%s' doesn't exist in config
sv: Kunde ej hitta nyckeln '%s' i konfigurationen

source: List of valid commands:
sv: Giltiga kommandon:

source: Make sure you have the file system permissions to create this directory
sv: Kontrollera att du har de nödvändiga rättigheterna för att skapa den här mappen

source: Movable packages
sv: Flyttbara paket

source: No default.desktop was found in the meta-data for this package.
sv: Filen default.desktop kunde ej hittas i paketets metadata.

source: Package '%s' is missing some of its dependencies
sv: Paketet '%s' saknar några av sina beroenden

source: Package ID:
sv: Paket-ID:

source: Package is for
sv: Paketet är för

source: Package name
sv: Paketnamn

source: Path:
sv: Sökväg:

source: Removable packages:
sv: Flyttbara paket:

source: Runs a DBP file's default application
sv: Kör en DBP-fils standardvalsapplikation

source: Runs a registered DBP by its id
sv: Kör en i DBP-systemet registrerad paketfil baserat på sitt ID-nummer

source: System packages
sv: Systempaket

source: System packages:
sv: Systempaket:

source: The DBP System Daemon is not responding. Make sure it's running
sv: DBP-systemets demon svarar inte. Kontrollera att den körs

source: The DBP System Daemon was unable to assign the package file to a device node. ioctl failed.
sv: DBP-systemet kunde inte tilldela paketfilen på en enhetsnod (device node): ioctl misslyckades.

source: The application may or may not work at all without these. It is recommended that you use a package manager to install the missing dependencies.
sv: Programmet kanske inte fungerar över huvud taget utan dessa paket. Du bör installera dessa med en pakethanterare.

source: The meta-data in this package is malformed: Illegal character(s) was found in a generated mountpoint.
sv: Paketfilens meta-data är defekt: Otillåtna tecken detekterades i den genererade monteringspunkten.

source: The meta-data in this package is malformed: Illegal character(s) were found in a generated mountpoint.
sv: Paketfilens meta-data är ogiltig: Otillåtna tecken hittades i den genererade monteringspunkten.

source: The package file could not be opened. Make sure it's still accessable.
sv: Paketfilen kunde inte öppnas. Kontrollera att den är åtkomlig.

source: The package with this ID is already registered! This is not an error, and you shouldn't see this message.
sv: En paketfil med detta ID är redan registrerad! Det här är inte ett fel, och du bör inte se det här meddelandet.

source: The program exited abnormally for an unknown reason.
sv: Programmet avslutades på ett onormalt sätt av en okänd anledning.

source: The program has crashed from a segmentation fault. This likely a bug in the program.
sv: Programmet krashade med ett segmenteringsfel. Det här är sannolikt ett fel i programmet.

source: The program was killed by a signal
sv: Programmet slogs ihjäl av en signal

source: The system has ran out of loopback device nodes. Try closing some applications and try again.
sv: Systemet har slut på slingenheter (loop devices.) Prova att stänga några program och försök igen.

source: This package lacks a default executable, and therefore cannot be executed directly.
sv: Paketfilen saknar ett standardvalsprogram, och kan därför inte exekveras direkt.

source: Unable to access the package filesystem. This DBP-file is likely corrupt.
sv: Kunde ej läsa paketfilens filsystem. Paketfilen är antagligen trasig.

source: Unable to allocate system resources. You're probably out of RAM. Close some programs and try again.
sv: Kunde inte allokera systemresurser. Systemet har antagligen slut på arbetsminne. Stäng några program och försök igen.

source: Unable to create appdata directory
sv: Kunde inte skapa applikationsdatakatakogen

source: Unable to extract exec from package meta data
sv: Kunde inte extrahera den körbara filen från paketets metadata.

source: Unable to open config file %s
sv: Kunde inte öppna konfigurationsfilen %s

source: Unable to open package %s
sv: Kunde inte öppna paketet %s

source: Unable to read meta-data from package. The package file is likely corrupt. Try re-downloading it.
sv: Kunde inte läsa metadata från paketfilen. Paketet är antagligen trasigt. Ladda ner paketet på nytt och försök igen.

source: Unable to set up AuFS union. This is likely a bug. This may temporarily be worked around by rebooting.
sv: Kunde inte sätta upp en AuFS-union. Det här är antagligen ett problem i DBP-systemet. Problemet kanske kan åtgärdas temporärt genom att starta om systemet.

source: Unknown
sv: Ökänd

source: Usage:
sv: Användning:

source: Usage: %s <config key>
sv: Användning: %s <konfigurationsnyckel>

source: Usage: dbp-cmd <command> [arg]
sv: Användning: dbp-cmd <kommando> [argument]

source: Usage: dbp-run [--gui-errors] [--log-output] [--chdir] <package id> <executable> [arg1] [arg2] ...
sv: Användning: dbp-run-path [--gui-errors] <paket-ID> [arg1] [arg2] ...

source: Usage: dbp-run-path [--gui-errors] <path to .dbp> [arg1] [arg2] ...
sv: Användning: dbp-run-path [--gui-errors] <sökväg till .dbp> [arg1] [arg2] ...

source: You've attempted to launch a program from a package that could not be found in the local database. This is likely a bug.
sv: Du har försökt att starta ett program som inte är registrerat i den lokala databasen. Det här är antagligen ett fel i DBP-systemet.

source: Your user doesn't have the permissions needed to create the application data directory on the SD-card that this application is installed on.
sv: Du saknar behörighet att skapa appdata-mappen på mediat som det här programmet är installerat på.

source: dbp-meta get <path-to-dbp> <key> [locale] - Returns the value of meta-key <key>
sv: dbp-meta get <sökväg till dbp> <nyckel> [språk] - Returnerar värdet på meta-nyckeln <nyckel>

source: dbp-meta list <path-to-dbp> - lists all meta keys for the package
sv: dbp-meta list <sökväg till dbp> - listar alla nyckel-värde-par i metadatan för paketet

source: pkgid is a unique ID that every valid package has.
sv: Paket-ID är ett unikt ID som varje giltigt paket har.
